:PROPERTIES:
:ID:       d4acf534-f60c-4471-bee8-f4b925dd0d90
:END:
#+TITLE: SOPS
#+CATEGORY: slips
#+TAGS:  

***** Nevermind...

#+begin_quote
just ensure you use =yq -Y=. there are probably some caveats to this.
#+end_quote

Can't easily use =yq -y=, since it strips YAML of special characters (e.g. for
multiline strings). Options like =--raw-output0= don't seem to fix it (and since
=yq= only converts back to YAML after completion, none of these options will)

#+begin_src shell :results output code :wrap example yaml
yq -iy '.ykbootstrap += {some_unencrypted: "config"}' $y
# yq -iy 'delpaths([["ykbootstrap","some_unencrypted"]])' $y
yq .sops.age[0].enc -y $y # OOF. use json, i guess?
#+end_src

#+RESULTS:
#+begin_example yaml
'-----BEGIN AGE ENCRYPTED FILE-----

  YWdlLWVuY3J5cHRpb24ub3JnL3YxCi0+IFgyNTUxOSBmUld3ejlqSmNGcjhrNzFp

  d0hPR2pRWUZXM3ZZWUpReUlFeElNNnRMYTFVCnh6a3FGOHRITGpqR3ltLy9UNUpX

  NjVmcXE3NDB6WW1kalpOeWJXU2JJMkUKLS0tIGlIN0s2VE5vTVc0MHVPeTVRK2RC

  OW4zVzBWT3lrSXI5OUY2YUNsb2NSOUUKlCOEWMVq2WyMtmonHgD6sICy0tA0Cstj

  aJGVsJUgE1iwgCfzqzyVf3odynmpeLjYwoXatQ9tggX/+FnS3rDvsQ==

  -----END AGE ENCRYPTED FILE-----

  '
#+end_example

